Repository: OsamaMohammed3332/metatris_game_package_temp
Catalog: lib/l10n/app_*.arb
Languages: ar

# changeLanguage
source: Ø¹
ar: EN

source: METATRIS
ar: ميتاترس

source: Show Bar
ar: اظهار المؤشر

source: Show Score
ar: اظهار النتيجة

source: Eye Tracking
ar: تتبع العين

# username
source: Enter Username
ar: ادخل اسم المستخدم

# usernameRequiredField
source: Please Enter a Username!
ar: من فضلك قم بادخال اسم المستخدم

source: Play
ar: ابدأ

source: Tutorial
ar: دورة تعليمية

source: Next
ar: التالي

source: Go
ar: انطلق

source: Done
ar: تم

source: Score:
ar: النتيجة:

source: Tetrises
ar: المكعبات

source: Lines
ar: الصفوف

source: Level
ar: المستوى

# games
source: Game
ar: الجولات

# nextBlock
source: Next
ar: التالي

source: Start
ar: تشغيل

source: Stop
ar: إيقاف

source: Game Over
ar: انتهت اللعبة

source: End Score:
ar: :النتيجة النهائية

source: Try Again
ar: حاول مجدداً

source: View Eye Tracking Results
ar: عرض نتائج تتبع العين

source: Skip
ar: تخطي

# welcomeToTheMetatris
source: Welcome to the Metatris Game!
ar: مرحبًا بك في لعبة ميتاترس!

# hereWeWillExplain
source: Here we will explain how to play this fun and exciting game.
ar: هنا سنشرح كيفية لعب هذه اللعبة الممتعة والمثيرة.

# gameBlocksWillFall
source: Game blocks will fall one at a time from the top.
ar: سوف تسقط كتل اللعبة واحدة تلو الأخرى من الأعلى.

# fitTheBlocksTogether
source: Fit the blocks together to make lines (without spaces if you can!)going across.
ar: اجمع الكتل معًا لتكوين خطوط (بدون فراغات إذا استطعت!).

source: Tap the
ar: اضغط على

source: arrow keys
ar: مفاتيح الأسهم

# toMoveTheBlocksLeftAndRight
source: to move the blocks left and right or press down to drop faster.
ar: لتحريك الكتل يسارًا ويمينًا أو اضغط لأسفل للإسقاط بشكل أسرع.

source: rotation keys
ar: مفاتيح الدوران

# toTurnTheBlocksAround
source: to turn the blocks around clockwise and counterclockwise.
ar: لتدوير الكتل بإتجاه عقارب الساعة وعكس إتجاه عقارب الساعة.

# whenYouMakeALine
source: When you make a line the entire stack goes down.
ar: عندما تكون خطًا، ينزل الكومة بأكملها.

# ifYourStackReaches
source: If your stack reaches the very top you lose the game.
ar: إذا وصلت كومتك إلى الأعلى تمامًا، فأنت تخسر اللعبة.

# theGameWillIncrease
source: The game will increase in speed as you get better with blocks falling faster and faster.
ar: سوف تزداد سرعة اللعبة كلما تحسنت مع سقوط الكتل بشكل أسرع وأسرع.

# scoringATetris
source: Scoring a Tetris is an advanced move and you get more points!
ar: تسجيل تتريس هو حركة متقدمة وتحصل على المزيد من النقاط!

# useTheLongBar
source: Use the long bar to clear four lines at once and score a "tetris"
ar: استخدم الشريط الطويل لمسح أربع خطوط في آن واحد وتسجيل "تتريس"

# youMightOnlySeeYourScore
source: You might only see your score and stats.
ar: قد ترى فقط نتيجتك وإحصائياتك.

# useThisInformationToMotivate
source: Use this information to motivate yourself:
ar: استخدم هذه المعلومات لتحفيز نفسك:

# tryAndGetHigher
source: try and get higher and higher scores!
ar: حاول واحصل على نتائج أعلى وأعلى!

# youMightSeeAGreen
source: You might see a green and red moving bar.
ar: قد ترى شريطًا أخضر وأحمر متحرك.

# thisBarTellsYou
source: This bar tells you how well you are playing.
ar: هذا الشريط يخبرك بمدى جودة أدائك.

# ifYouAreInTheGreen
source: If you are in the green you are doing well.
ar: إذا كنت في الأخضر فأنت تقوم بشكل جيد.

source: Both the
ar: كلا من

# scoreWithSmallLetters
source: score
ar: النتيجة

source: and the
ar: و

source: bar
ar: الشريط

source: will be on the screen.
ar: سيكون على الشاشة.

# focusOnYourScoreBut
source: Focus on your score but use the bar to help guide how you're playing.
ar: ركز على نتيجتك ولكن استخدم الشريط لمساعدتك في توجيه أدائك.

# readyForAPractice
source: Ready for a practice run?
ar: هل أنت مستعد لجولة تدريبية؟

# tryAndSeeHowMany
source: Try and see how many lines you can clear in 30 seconds.
ar: حاول وشاهد كم عدد الخطوط التي يمكنك مسحها في 30 ثانية.

source: Have Fun!!
ar: استمتع!!

# thereIsNoPointInPlaying
source: There's no point in playing a game if you are not having fun
ar: لا معنى للعب إذا لم تكن تستمتع

source: Exit
ar: اخرج
